[NoCoverage] StringLiteral
src/drizzle/schema/movies.ts:6:21
 export const movies = pgTable('movies', {
   id: serial('id').primaryKey(),
   title: varchar('title', { length: 255 }).notNull(),
-  description: text('description'),
+  description: text(""),
   posterUrl: varchar('poster_url', { length: 500 }),
   genre: varchar('genre', { length: 100 }).notNull(),

[NoCoverage] StringLiteral
src/drizzle/schema/movies.ts:9:24
   description: text('description'),
   posterUrl: varchar('poster_url', { length: 500 }),
   genre: varchar('genre', { length: 100 }).notNull(),
-  createdAt: timestamp('created_at').notNull().defaultNow(),
+  createdAt: timestamp("").notNull().defaultNow(),
   updatedAt: timestamp('updated_at').notNull().defaultNow(),
 });
