[NoCoverage] ObjectLiteral
src/drizzle/schema/reservations.ts:9:53
   timestamp,
 } from 'drizzle-orm/pg-core';
 
-export const reservations = pgTable('reservations', {
-  id: serial('id').primaryKey(),
-  userId: integer('user_id').notNull(),
-  showtimeId: integer('showtime_id').notNull(),
-  seatId: integer('seat_id').notNull(),
-  status: varchar('status', { length: 50 }).notNull().default('pending'),
-  createdAt: timestamp('created_at').notNull().defaultNow(),
-  updatedAt: timestamp('updated_at').notNull().defaultNow(),
-});
+export const reservations = pgTable('reservations', {});
 
 export type Reservation = typeof reservations.$inferSelect;

[NoCoverage] StringLiteral
src/drizzle/schema/reservations.ts:9:37
   timestamp,
 } from 'drizzle-orm/pg-core';
 
-export const reservations = pgTable('reservations', {
+export const reservations = pgTable("", {
   id: serial('id').primaryKey(),
   userId: integer('user_id').notNull(),

[NoCoverage] StringLiteral
src/drizzle/schema/reservations.ts:12:23
 export const reservations = pgTable('reservations', {
   id: serial('id').primaryKey(),
   userId: integer('user_id').notNull(),
-  showtimeId: integer('showtime_id').notNull(),
+  showtimeId: integer("").notNull(),
   seatId: integer('seat_id').notNull(),
   status: varchar('status', { length: 50 }).notNull().default('pending'),

[NoCoverage] StringLiteral
src/drizzle/schema/reservations.ts:15:24
   showtimeId: integer('showtime_id').notNull(),
   seatId: integer('seat_id').notNull(),
   status: varchar('status', { length: 50 }).notNull().default('pending'),
-  createdAt: timestamp('created_at').notNull().defaultNow(),
+  createdAt: timestamp("").notNull().defaultNow(),
   updatedAt: timestamp('updated_at').notNull().defaultNow(),
 });

[NoCoverage] StringLiteral
src/drizzle/schema/reservations.ts:16:24
   seatId: integer('seat_id').notNull(),
   status: varchar('status', { length: 50 }).notNull().default('pending'),
   createdAt: timestamp('created_at').notNull().defaultNow(),
-  updatedAt: timestamp('updated_at').notNull().defaultNow(),
+  updatedAt: timestamp("").notNull().defaultNow(),
 });
 
