[NoCoverage] StringLiteral
src/drizzle/schema/seats.ts:9:30
   timestamp,
 } from 'drizzle-orm/pg-core';
 
-export const seats = pgTable('seats', {
+export const seats = pgTable("", {
   id: serial('id').primaryKey(),
   screenId: integer('screen_id').notNull(),

[NoCoverage] ObjectLiteral
src/drizzle/schema/seats.ts:9:39
   timestamp,
 } from 'drizzle-orm/pg-core';
 
-export const seats = pgTable('seats', {
-  id: serial('id').primaryKey(),
-  screenId: integer('screen_id').notNull(),
-  row: varchar('row', { length: 5 }).notNull(),
-  number: integer('number').notNull(),
-  createdAt: timestamp('created_at').notNull().defaultNow(),
-});
+export const seats = pgTable('seats', {});
 
 export type Seat = typeof seats.$inferSelect;

[NoCoverage] ObjectLiteral
src/drizzle/schema/seats.ts:12:23
 export const seats = pgTable('seats', {
   id: serial('id').primaryKey(),
   screenId: integer('screen_id').notNull(),
-  row: varchar('row', { length: 5 }).notNull(),
+  row: varchar('row', {}).notNull(),
   number: integer('number').notNull(),
   createdAt: timestamp('created_at').notNull().defaultNow(),

[NoCoverage] StringLiteral
src/drizzle/schema/seats.ts:12:16
 export const seats = pgTable('seats', {
   id: serial('id').primaryKey(),
   screenId: integer('screen_id').notNull(),
-  row: varchar('row', { length: 5 }).notNull(),
+  row: varchar("", { length: 5 }).notNull(),
   number: integer('number').notNull(),
   createdAt: timestamp('created_at').notNull().defaultNow(),
