[NoCoverage] StringLiteral
src/drizzle/schema/showtimes.ts:5:20
 
 export const showtimes = pgTable('showtimes', {
   id: serial('id').primaryKey(),
-  movieId: integer('movie_id').notNull(),
+  movieId: integer("").notNull(),
   screenId: integer('screen_id').notNull(),
   startTime: timestamp('start_time').notNull(),

[NoCoverage] StringLiteral
src/drizzle/schema/showtimes.ts:6:21
 export const showtimes = pgTable('showtimes', {
   id: serial('id').primaryKey(),
   movieId: integer('movie_id').notNull(),
-  screenId: integer('screen_id').notNull(),
+  screenId: integer("").notNull(),
   startTime: timestamp('start_time').notNull(),
   endTime: timestamp('end_time').notNull(),

[NoCoverage] StringLiteral
src/drizzle/schema/showtimes.ts:7:24
   id: serial('id').primaryKey(),
   movieId: integer('movie_id').notNull(),
   screenId: integer('screen_id').notNull(),
-  startTime: timestamp('start_time').notNull(),
+  startTime: timestamp("").notNull(),
   endTime: timestamp('end_time').notNull(),
   createdAt: timestamp('created_at').notNull().defaultNow(),

[NoCoverage] StringLiteral
src/drizzle/schema/showtimes.ts:8:22
   movieId: integer('movie_id').notNull(),
   screenId: integer('screen_id').notNull(),
   startTime: timestamp('start_time').notNull(),
-  endTime: timestamp('end_time').notNull(),
+  endTime: timestamp("").notNull(),
   createdAt: timestamp('created_at').notNull().defaultNow(),
 });

[NoCoverage] StringLiteral
src/drizzle/schema/showtimes.ts:9:24
   screenId: integer('screen_id').notNull(),
   startTime: timestamp('start_time').notNull(),
   endTime: timestamp('end_time').notNull(),
-  createdAt: timestamp('created_at').notNull().defaultNow(),
+  createdAt: timestamp("").notNull().defaultNow(),
 });
 
