[NoCoverage] StringLiteral
src/drizzle/schema/users.ts:3:30
 import { pgTable, serial, varchar, timestamp } from 'drizzle-orm/pg-core';
 
-export const users = pgTable('users', {
+export const users = pgTable("", {
   id: serial('id').primaryKey(),
   email: varchar('email', { length: 255 }).notNull().unique(),

[NoCoverage] ObjectLiteral
src/drizzle/schema/users.ts:5:27
 
 export const users = pgTable('users', {
   id: serial('id').primaryKey(),
-  email: varchar('email', { length: 255 }).notNull().unique(),
+  email: varchar('email', {}).notNull().unique(),
   passwordHash: varchar('password_hash', { length: 255 }).notNull(),
   name: varchar('name', { length: 255 }).notNull(),
