[NoCoverage] BlockStatement
src/main.ts:12:28
 
 dotenv.config({ path: '.env.local' });
 
-async function bootstrap() {
-  const app = await NestFactory.create(AppModule);
-
-  app.use(helmet());
-  app.use(cors());
-  app.use(
-    rateLimit({
-      windowMs: 15 * 60 * 1000,
-      limit: 100,
-    }),
-  );
-
-  const config = new DocumentBuilder()
-    .setTitle('Movie Reservation API')
-    .setDescription('API for movie reservation system')
-    .setVersion('1.0')
-    .addBearerAuth()
-    .build();
-  const document = SwaggerModule.createDocument(app, config);
-  SwaggerModule.setup('api/docs', app, document);
-
-  const configService = app.get(ConfigService);
-  const port = configService.get<number>('PORT') || 3000;
-  await app.listen(port);
-}
+async function bootstrap() {}
 bootstrap();
 

[NoCoverage] ArithmeticOperator
src/main.ts:19:17
   app.use(cors());
   app.use(
     rateLimit({
-      windowMs: 15 * 60 * 1000,
+      windowMs: 15 / 60 * 1000,
       limit: 100,
     }),

[NoCoverage] ArithmeticOperator
src/main.ts:19:17
   app.use(cors());
   app.use(
     rateLimit({
-      windowMs: 15 * 60 * 1000,
+      windowMs: 15 * 60 / 1000,
       limit: 100,
     }),

[NoCoverage] StringLiteral
src/main.ts:25:15
   );
 
   const config = new DocumentBuilder()
-    .setTitle('Movie Reservation API')
+    .setTitle("")
     .setDescription('API for movie reservation system')
     .setVersion('1.0')

[NoCoverage] StringLiteral
src/main.ts:26:21
 
   const config = new DocumentBuilder()
     .setTitle('Movie Reservation API')
-    .setDescription('API for movie reservation system')
+    .setDescription("")
     .setVersion('1.0')
     .addBearerAuth()

[NoCoverage] ConditionalExpression
src/main.ts:34:16
   SwaggerModule.setup('api/docs', app, document);
 
   const configService = app.get(ConfigService);
-  const port = configService.get<number>('PORT') || 3000;
+  const port = true;
   await app.listen(port);
 }

[NoCoverage] ConditionalExpression
src/main.ts:34:16
   SwaggerModule.setup('api/docs', app, document);
 
   const configService = app.get(ConfigService);
-  const port = configService.get<number>('PORT') || 3000;
+  const port = false;
   await app.listen(port);
 }
