[NoCoverage] BlockStatement
src/shared/pipes/zod-validation.pipe.ts:13:57
 export class ZodValidationPipe implements PipeTransform {
   constructor(private schema: ZodSchema) {}
 
-  transform(value: unknown, metadata: ArgumentMetadata) {
-    if (metadata.type !== 'body') {
-      return value;
-    }
-
-    const result = this.schema.safeParse(value);
-
-    if (!result.success) {
-      throw new BadRequestException({
-        message: 'Validation failed',
-        errors: result.error.issues.map((issue) => ({
-          path: issue.path.join('.'),
-          message: issue.message,
-        })),
-      });
-    }
-
-    return result.data;
-  }
+  transform(value: unknown, metadata: ArgumentMetadata) {}
 }
 

[NoCoverage] ConditionalExpression
src/shared/pipes/zod-validation.pipe.ts:14:9
   constructor(private schema: ZodSchema) {}
 
   transform(value: unknown, metadata: ArgumentMetadata) {
-    if (metadata.type !== 'body') {
+    if (false) {
       return value;
     }

[NoCoverage] BlockStatement
src/shared/pipes/zod-validation.pipe.ts:14:35
   constructor(private schema: ZodSchema) {}
 
   transform(value: unknown, metadata: ArgumentMetadata) {
-    if (metadata.type !== 'body') {
-      return value;
-    }
+    if (metadata.type !== 'body') {}
 
     const result = this.schema.safeParse(value);

[NoCoverage] ConditionalExpression
src/shared/pipes/zod-validation.pipe.ts:20:9
 
     const result = this.schema.safeParse(value);
 
-    if (!result.success) {
+    if (false) {
       throw new BadRequestException({
         message: 'Validation failed',

[NoCoverage] BooleanLiteral
src/shared/pipes/zod-validation.pipe.ts:20:9
 
     const result = this.schema.safeParse(value);
 
-    if (!result.success) {
+    if (result.success) {
       throw new BadRequestException({
         message: 'Validation failed',

[NoCoverage] ArrowFunction
src/shared/pipes/zod-validation.pipe.ts:23:41
     if (!result.success) {
       throw new BadRequestException({
         message: 'Validation failed',
-        errors: result.error.issues.map((issue) => ({
-          path: issue.path.join('.'),
-          message: issue.message,
-        })),
+        errors: result.error.issues.map(() => undefined),
       });
     }

[NoCoverage] StringLiteral
src/shared/pipes/zod-validation.pipe.ts:24:33
       throw new BadRequestException({
         message: 'Validation failed',
         errors: result.error.issues.map((issue) => ({
-          path: issue.path.join('.'),
+          path: issue.path.join(""),
           message: issue.message,
         })),
